Revit 2027 API
BuiltInFailures.SketchFailures.PlanarMultiPlanarShapeInSketch Property
 The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PlanarMultiPlanarShapeInSketch { get; }
Public Shared ReadOnly Property PlanarMultiPlanarShapeInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PlanarMultiPlanarShapeInSketch {
	FailureDefinitionId^ get ();
}
static member PlanarMultiPlanarShapeInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace